[
  {
    "id": 1,
    "title": "Bubbalous Bodacious BBQ",
    "description": "Savor the digital flavor of Orlando's premier BBQ experience! This mouth-watering website brings the smoky goodness of Bubbalous Bodacious BBQ directly to your screen. Customers can browse our signature menu, order party packs for special occasions, and place online orders with just a few clicks. Built with cutting-edge web technology that works seamlessly on phones, tablets, and computers, ensuring every customer gets the full BBQ experience whether they're dining in or ordering from home.",
    "deployedLink": "https://bubbalous-bodacious.vercel.app/",
    "logo": "/projects/bubbalous-bodacious-bbq/logo.jpg",
    "keyFeatures": [
      "Theme Toggle System: Seamless dark/light mode switching with persistent user preferences stored in localStorage and automatic system preference detection.",
      "Mobile-First Responsive Design: Optimized layouts for all screen sizes with a collapsible mobile navigation menu featuring smooth animations and intuitive touch interactions.",
      "Online Ordering System: Complete e-commerce functionality with shopping cart, item customization, checkout process, and localStorage persistence for cart items across sessions.",
      "Dynamic Image Carousel: Auto-rotating banner images showcasing delicious BBQ dishes with manual navigation controls and smooth transitions, optimized using Next.js Image component for performance.",
      "SEO-Optimized Pages: Each page includes comprehensive metadata with titles, descriptions, and keywords optimized for search engines. Next.js server-side rendering ensures content is crawlable and indexable."
    ],
    "technologyStack": [
      "Styling: CSS Modules with CSS Custom Properties for dynamic theming",
      "Frameworks/Libraries: Next.js 16 (App Router), React 19, Next.js Image optimization",
      "State Management: React Hooks (useState, useEffect) for component-level state management",
      "Runtime: Node.js",
      "Framework: Next.js (full-stack framework with API routes capability)",
      "Icons: Font Awesome",
      "Data Management: JSON files for menu and party pack data",
      "Font Loading: Next.js Google Fonts integration (Oswald, Inter)",
      "SEO: Next.js Metadata API for comprehensive page metadata and Open Graph tags",
      "Local Storage: Browser localStorage API for cart persistence and theme preferences",
      "Responsive Design: Mobile-first approach using CSS Grid, Flexbox, and media queries"
    ],
    "screenshots": [
      "/projects/bubbalous-bodacious-bbq/screenshots/homePage.png",
      "/projects/bubbalous-bodacious-bbq/screenshots/menuPage.png",
      "/projects/bubbalous-bodacious-bbq/screenshots/partyPacksPage.png",
      "/projects/bubbalous-bodacious-bbq/screenshots/orderOnlinePage.png",
      "/projects/bubbalous-bodacious-bbq/screenshots/checkout.png",
      "/projects/bubbalous-bodacious-bbq/screenshots/darkTheme.png"
    ]
  },
  {
    "id": 2,
    "title": "Kingdom Movement",
    "description": "Transform your fitness journey with Kingdom Movement's powerful digital platform! This dynamic website empowers fitness enthusiasts to discover their strength through interactive class schedules, personalized nutrition guidance, and flexible membership options. Whether you're a CrossFit beginner or seasoned athlete, the platform adapts to your device and fitness goals. The smart technology behind the scenes ensures smooth navigation and real-time updates, making it easier than ever to join the Kingdom Movement community and achieve your wellness aspirations.",
    "deployedLink": "https://kingdom-movement.vercel.app/",
    "logo": "/projects/kingdom-movement/logo.jpg",
    "keyFeatures": [
      "Responsive Design: Fully responsive layout optimized for desktop, tablet, and mobile devices. Adaptive navigation with mobile sidebar menu and sticky header functionality.",
      "Expert Coach Profiles: Interactive carousel showcasing expert trainers with detailed profiles, images, and descriptions. Auto-rotating carousel with manual navigation controls.",
      "Dark/Light Theme Toggle: Persistent theme switching with system preference detection. Theme preferences are saved to localStorage for consistent user experience across sessions.",
      "Interactive Class Schedule: View weekly class schedules with day-by-day navigation. The schedule displays activities, times, and handles closed days with user-friendly messaging.",
      "Comprehensive Nutrition Menu: Browse over 30+ nutrition items with category filtering. Each item includes detailed descriptions, images, and customization options (add-ons, extras, premium flavors).",
      "Membership Tier Selection: Explore multiple membership options with detailed benefits, pricing, and sign-up links. Features include popular tier highlighting and comprehensive additional information sections."
    ],
    "technologyStack": [
      "UI Library: React 19.2.3",
      "Framework: Next.js 16.1.1 (App Router)",
      "Image Optimization: Next.js Image component",
      "Styling: CSS Modules with CSS Variables for theming",
      "State Management: React Hooks (useState, useEffect, useRef)",
      "Font Optimization: Next.js Font Optimization (Anton, Bebas Neue, Roboto Condensed)",
      "Runtime: Node.js",
      "Framework: Next.js (Server-Side Rendering & Static Generation)",
      "Version Control: Git",
      "Build Tool: Next.js built-in bundler",
      "Code Quality: ESLint with Next.js configuration",
      "Data Storage: JSON files for static data (coaches, nutrition, schedule, membership)"
    ],
    "screenshots": [
      "/projects/kingdom-movement/screenshots/homePage.png",
      "/projects/kingdom-movement/screenshots/nutritionPage.png",
      "/projects/kingdom-movement/screenshots/schedulePage.png",
      "/projects/kingdom-movement/screenshots/membershipPage.png",
      "/projects/kingdom-movement/screenshots/lightTheme.png"
    ]
  },
  {
    "id": 3,
    "title": "Moonstar Esthetics",
    "description": "Discover your natural radiance with Moonstar Esthetics' luxurious digital sanctuary! This elegant website invites clients into a world of professional skincare excellence, showcasing advanced facial treatments, precision laser services, and comprehensive body care solutions. The sophisticated design mirrors the premium quality of services offered, while intelligent web technology ensures effortless booking and seamless user experience across all devices. Every pixel reflects the confidence, care, and clarity that defines the Moonstar Esthetics brand.",
    "deployedLink": "https://moonstar-esthetics.vercel.app/",
    "logo": "/projects/moonstar-esthetics/logo.jpg",
    "keyFeatures": [
      "Legal Pages: Includes Privacy Policy and Terms of Service for compliance and transparency, with dynamic date updates.",
      "Contact & Inquiry: Easy-to-use contact form for questions and appointment requests, with direct integration to email clients.",
      "Responsive Design: Fully mobile-friendly layout ensures a seamless experience on all devices, with a mobile-optimized navigation sidebar and adaptive layouts.",
      "Client Reviews: Real client testimonials build trust and credibility. The reviews page features an average rating display, rating distribution, and sortable review cards.",
      "Modern UI with Theme Toggle: Clean, elegant design with smooth transitions and interactive elements. Includes a light/dark theme toggle that respects user system preferences and persists across sessions.",
      "Service Catalog: Browse detailed listings for facial, laser/IPL, body, and waxing treatments, each with images, descriptions, pricing, and duration. Services can be sorted by price or duration for easy comparison."
    ],
    "technologyStack": [
      "CSS Modules: Scoped, maintainable styles for each component",
      "JavaScript (ES6+): Modern language features for robust, maintainable code",
      "React 19: Component-based UI library for building interactive user interfaces",
      "Next.js 16: React framework with App Router for server-side rendering, static generation, and optimized performance",
      "Next.js API Routes: Server-side functionality and routing",
      "Font Awesome: Icon library for UI elements",
      "JSON: Structured data storage for services and reviews",
      "Google Fonts: Montserrat and Libre Baskerville typography"
    ],
    "screenshots": [
      "/projects/moonstar-esthetics/screenshots/homePage.png",
      "/projects/moonstar-esthetics/screenshots/servicesPage.png",
      "/projects/moonstar-esthetics/screenshots/reviewsPage.png",
      "/projects/moonstar-esthetics/screenshots/informationPage.png",
      "/projects/moonstar-esthetics/screenshots/darkTheme.png"
    ]
  },
  {
    "id": 4,
    "title": "Reelix",
    "description": "Dive into the ultimate entertainment universe with Reelix! This cinematic discovery platform transforms how you explore movies and TV shows, featuring real-time data from the world's largest entertainment database. Navigate effortlessly through trending films, top-rated series, and personalized recommendations with lightning-fast performance. The sleek dark interface creates the perfect movie theater ambiance, while smart technology automatically adapts to your region and language preferences. Whether you're a casual viewer or film enthusiast, Reelix delivers an immersive entertainment experience that brings the magic of cinema to your fingertips.",
    "deployedLink": "https://reelix-2.vercel.app/",
    "logo": "/projects/reelix/logo.png",
    "keyFeatures": [
      "Top IMDB Ratings: Dedicated page showcasing the highest-rated movies from TMDB, with detailed metadata and certification information.",
      "Performance Optimized: Leverages Next.js Image component for optimized image loading, font optimization, and efficient code splitting.",
      "SEO Optimized: Built with Next.js for optimal search engine optimization, including proper metadata, semantic HTML, and server-side rendering.",
      "Responsive Design: Fully responsive layout optimized for desktops, tablets, smartphones, and smart TVs, ensuring a consistent experience across all devices.",
      "Advanced Filtering System: Users can filter movies and TV shows by genre, year, and country with real-time URL parameter updates for shareable filtered views.",
      "Comprehensive Search: Powerful search functionality that queries both movies and TV shows simultaneously, intelligently selecting the best match based on vote counts.",
      "Detailed Media Pages: Each movie or TV show features a comprehensive detail page with poster, backdrop banner, trailer links, cast, crew, genres, ratings, and runtime information."
    ],
    "technologyStack": [
      "Frameworks/Libraries: Next.js 16 (App Router), React 19",
      "Styling: CSS Modules for scoped, maintainable component styling",
      "Font Optimization: Next.js Font Optimization (Bebas Neue, Montserrat)",
      "Runtime: Node.js",
      "Framework: Next.js (Server-Side Rendering, API Routes)",
      "API Integration: The Movie Database (TMDB) API for real-time media data",
      "Image Optimization: Next.js Image component for optimized image loading",
      "Environment Variables: Next.js environment variable management",
      "Deployment: Optimized for Vercel, Netlify, or similar Next.js-compatible platforms"
    ],
    "screenshots": [
      "/projects/reelix/screenshots/homePage.png",
      "/projects/reelix/screenshots/moviesPage.png",
      "/projects/reelix/screenshots/tvShowsPage.png",
      "/projects/reelix/screenshots/topIMDBPage.png"
    ]
  }
]