[
  {
    "id": 1,
    "title": "Bubbalous Bodacious BBQ",
    "description": "Savor the digital flavor of Orlando's premier BBQ experience! This mouth-watering website brings the smoky goodness of Bubbalous Bodacious BBQ directly to your screen. Customers can browse our signature menu, order party packs for special occasions, and place online orders with just a few clicks. Built with cutting-edge web technology that works seamlessly on phones, tablets, and computers, ensuring every customer gets the full BBQ experience whether they're dining in or ordering from home.",
    "deployedLink": "https://bubbalous-bodacious.vercel.app/",
    "logo": "/projects/bubbalous-bodacious-bbq/logo.jpg",
    "keyFeatures": [
      "Dynamic Image Carousel: Auto-rotating banner images showcasing delicious BBQ dishes with manual navigation controls and smooth transitions.",
      "Legal Compliance Pages: Complete Privacy Policy and Terms of Service pages ensuring regulatory compliance and transparency for business operations.",
      "Accessibility Features: Semantic HTML structure, ARIA labels, keyboard navigation support, and high contrast theme options for inclusive user experience.",
      "Theme Toggle System: Seamless dark/light mode switching with persistent user preferences stored in localStorage and automatic system preference detection.",
      "Performance Optimized: Fast loading times through Vite bundling, efficient image formats (AVIF), and optimized component rendering for superior user experience.",
      "Party Pack Ordering: Specialized section for catering and large group orders with detailed package information, serving sizes, and pricing for events of various scales.",
      "Mobile-First Responsive Design: Optimized layouts for all screen sizes with a collapsible mobile navigation menu featuring smooth animations and intuitive touch interactions.",
      "Comprehensive Menu System: Complete menu with categorized sections including appetizers, sandwiches, dinners, combos, and by-the-pound options, all managed through structured JSON data.",
      "Interactive Contact Form: Secure contact system with CAPTCHA verification to prevent spam while maintaining accessibility, featuring email integration for direct communication."
    ],
    "technologyStack": [
      "Local Storage API: Client-side data persistence for user preferences and theme settings without server dependencies.",
      "CSS Modules: Scoped styling system preventing style conflicts while maintaining modular, maintainable CSS architecture.",
      "CSS Custom Properties: Dynamic theming system enabling real-time theme switching and consistent design token management.",
      "React 19: Modern component-based UI library for building interactive user interfaces with hooks and functional components.",
      "Vite: Lightning-fast build tool and development server providing instant hot module replacement and optimized production builds.",
      "JavaScript ES6+: Modern JavaScript features including destructuring, arrow functions, and template literals for clean, readable code.",
      "React Router DOM: Client-side routing solution enabling single-page application navigation with dynamic page titles and URL management.",
      "Responsive Design: Mobile-first approach using CSS Grid, Flexbox, and media queries for optimal viewing across all devices and screen sizes.",
      "JSON Data Management: Structured data storage for menu items, party packs, and restaurant information enabling easy content updates and maintenance."
    ],
    "screenshots": [
      "/projects/bubbalous-bodacious-bbq/screenshots/homePage.png",
      "/projects/bubbalous-bodacious-bbq/screenshots/menuPage.png",
      "/projects/bubbalous-bodacious-bbq/screenshots/partyPacksPage.png",
      "/projects/bubbalous-bodacious-bbq/screenshots/orderOnlinePage.png",
      "/projects/bubbalous-bodacious-bbq/screenshots/checkout.png",
      "/projects/bubbalous-bodacious-bbq/screenshots/darkTheme.png"
    ]
  },
  {
    "id": 2,
    "title": "Kingdom Movement",
    "description": "Transform your fitness journey with Kingdom Movement's powerful digital platform! This dynamic website empowers fitness enthusiasts to discover their strength through interactive class schedules, personalized nutrition guidance, and flexible membership options. Whether you're a CrossFit beginner or seasoned athlete, the platform adapts to your device and fitness goals. The smart technology behind the scenes ensures smooth navigation and real-time updates, making it easier than ever to join the Kingdom Movement community and achieve your wellness aspirations.",
    "deployedLink": "https://kingdom-movement.vercel.app/",
    "logo": "/projects/kingdom-movement/logo.jpg",
    "keyFeatures": [
      "Legal Pages: Includes Privacy Policy and Terms of Service for compliance and transparency.",
      "Contact & Inquiry: Easy-to-use contact form for membership inquiries and general questions.",
      "Theme Toggle: Seamless dark/light mode switching for enhanced user experience and accessibility.",
      "Responsive Design: Mobile-first approach ensuring optimal viewing across all devices and screen sizes.",
      "Interactive Class Schedule: Day-by-day schedule navigation with real-time class information and activity types.",
      "Community-Focused Content: Brand messaging that emphasizes transformation, community, and purpose-driven fitness.",
      "Comprehensive Nutrition Menu: Categorized nutrition offerings with filtering capabilities and detailed product information.",
      "Dynamic Membership Tiers: Interactive membership cards showcasing different pricing plans with detailed benefits and features.",
      "Modern UI/UX: Clean, energetic design with smooth transitions and interactive elements reflecting the gym's bold brand identity."
    ],
    "technologyStack": [
      "HTML5: Semantic markup for accessibility and SEO optimization.",
      "Vite: Fast build tool and development server for modern web projects.",
      "JavaScript (ES6+): Modern language features for robust, maintainable code.",
      "React: Component-based UI library for building interactive user interfaces.",
      "JSON: Structured data storage for memberships, schedules, and nutrition items.",
      "CSS Custom Properties: Dynamic theming system for dark/light mode functionality.",
      "CSS Modules: Scoped, maintainable styles with CSS Grid and Flexbox for responsive layouts."
    ],
    "screenshots": [
      "/projects/kingdom-movement/screenshots/homePage.png",
      "/projects/kingdom-movement/screenshots/nutritionPage.png",
      "/projects/kingdom-movement/screenshots/schedulePage.png",
      "/projects/kingdom-movement/screenshots/membershipPage.png",
      "/projects/kingdom-movement/screenshots/lightTheme.png"
    ]
  },
  {
    "id": 3,
    "title": "Moonstar Esthetics",
    "description": "Discover your natural radiance with Moonstar Esthetics' luxurious digital sanctuary! This elegant website invites clients into a world of professional skincare excellence, showcasing advanced facial treatments, precision laser services, and comprehensive body care solutions. The sophisticated design mirrors the premium quality of services offered, while intelligent web technology ensures effortless booking and seamless user experience across all devices. Every pixel reflects the confidence, care, and clarity that defines the Moonstar Esthetics brand.",
    "deployedLink": "https://moonstar-esthetics.vercel.app/",
    "logo": "/projects/moonstar-esthetics/logo.jpg",
    "keyFeatures": [
      "Client Reviews: Real client testimonials build trust and credibility.",
      "Modern UI: Clean, elegant design with smooth transitions and interactive elements.",
      "Contact & Inquiry: Easy-to-use contact form for questions and appointment requests.",
      "Legal Pages: Includes Privacy Policy and Terms of Service for compliance and transparency.",
      "Responsive Design: Fully mobile-friendly layout ensures a seamless experience on all devices.",
      "Service Catalog: Browse detailed listings for facial, laser/IPL, body, and waxing treatments, each with images, descriptions, pricing, and duration."
    ],
    "technologyStack": [
      "HTML5: Semantic markup for accessibility and SEO.",
      "JSON: Structured data storage for services and reviews.",
      "CSS Modules: Scoped, maintainable styles for each component.",
      "Vite: Fast build tool and development server for modern web projects.",
      "JavaScript (ES6+): Modern language features for robust, maintainable code.",
      "React: Component-based UI library for building interactive user interfaces."
    ],
    "screenshots": [
      "/projects/moonstar-esthetics/screenshots/homePage.png",
      "/projects/moonstar-esthetics/screenshots/servicesPage.png",
      "/projects/moonstar-esthetics/screenshots/reviewsPage.png",
      "/projects/moonstar-esthetics/screenshots/informationPage.png",
      "/projects/moonstar-esthetics/screenshots/darkTheme.png"
    ]
  },
  {
    "id": 4,
    "title": "Reelix",
    "description": "Dive into the ultimate entertainment universe with Reelix! This cinematic discovery platform transforms how you explore movies and TV shows, featuring real-time data from the world's largest entertainment database. Navigate effortlessly through trending films, top-rated series, and personalized recommendations with lightning-fast performance. The sleek dark interface creates the perfect movie theater ambiance, while smart technology automatically adapts to your region and language preferences. Whether you're a casual viewer or film enthusiast, Reelix delivers an immersive entertainment experience that brings the magic of cinema to your fingertips.",
    "deployedLink": "https://reelix-2.vercel.app/",
    "logo": "/projects/reelix/logo.png",
    "keyFeatures": [
      "Responsive Filters: Users can filter content by genre, year, and country.",
      "Pagination Support: It includes custom-styled pagination to help users navigate through extensive result sets.",
      "Dynamic Movie & TV Data: It fetches and renders media information, including metadata and trailers, using the TMDB API.",
      "Vite-Powered Performance: The application boasts a fast development server, optimized build processes, and efficient preview commands.",
      "Detailed Media Pages: Each movie or show has a dedicated page featuring a poster, trailer, cast, crew, genres, and additional information.",
      "Modular Architecture: The codebase is designed with reusable components such as MediaDetail, MediaBanner, and Filter to ensure maintainability.",
      "Multilingual Auto-Translation: The application supports automatic translation into German, Spanish, Portuguese, and French, based on region settings.",
      "Dark UI with Red Accents: The user interface features a consistent, cinematic dark theme with red accents, styled using CSS Modules and a clean component architecture."
    ],
    "technologyStack": [
      "Node.js + npm: Utilized for dependency and script management.",
      "React: The core library for building the user interface with components.",
      "dotenv: Used to load environment variables, such as API keys and port numbers.",
      "CSS Modules: Provides scoped and maintainable styling for individual components.",
      "Vite: A fast bundler and development server optimized for modern JavaScript projects.",
      "React Router DOM: Handles dynamic routing for detail pages and filters within the application.",
      "Render: Employed for deploying the application as a web service with dynamic port configuration.",
      "TMDB API: Serves as the source for real-time media data, including metadata, images, and videos."
    ],
    "screenshots": [
      "/projects/reelix/screenshots/homePage.png",
      "/projects/reelix/screenshots/moviesPage.png",
      "/projects/reelix/screenshots/tvShowsPage.png",
      "/projects/reelix/screenshots/topIMDBPage.png"
    ]
  }
]